#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```

terraform
module.us-east-1.data.aws_vpc.default: Reading...
module.us-east-1.data.aws_lb.default-uat-l4-lb: Reading...
module.us-east-1.data.aws_subnet.default_us_east_1b: Reading...
module.us-east-1.data.aws_security_group.allow_nl_vpn_connect: Reading...
module.us-east-1.data.aws_security_group.allow_usopc_netblocks: Reading...
module.us-east-1.data.aws_region.current: Reading...
module.us-east-1.data.aws_security_group.allow_ec2_instance_connect: Reading...
module.us-east-1.data.aws_subnet.default_us_east_1a: Reading...
module.us-east-1.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.us-east-1.data.aws_subnet.default_us_east_1a: Read complete after 0s [id=subnet-0ff7b3fc389fe6dcb]
module.us-east-1.data.aws_subnet.default_us_east_1b: Read complete after 1s [id=subnet-01bf06733505d2a1b]
module.us-east-1.data.aws_security_group.allow_usopc_netblocks: Read complete after 1s [id=sg-0a4c132b969acf054]
module.us-east-1.data.aws_security_group.allow_nl_vpn_connect: Read complete after 1s [id=sg-09bbe3c39c0c54243]
module.us-east-1.data.aws_security_group.allow_ec2_instance_connect: Read complete after 1s [id=sg-05d4832e2eef6705f]
module.us-east-1.data.aws_lb.default-uat-l4-lb: Read complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:017744138587:loadbalancer/net/default-uat-l4-lb/c2a0115e13f31eb4]
module.us-east-1.data.aws_vpc.default: Read complete after 1s [id=vpc-0c3b58cdc704ad2f5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.us-east-1.aws_instance.usopc_uat_web01 will be created
  + resource "aws_instance" "usopc_uat_web01" {
      + ami                                  = "ami-026b57f3c383c2eec"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "usopc-nl-deployer-uat"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"       = "usopc-uat-web01"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
          + "zone"       = "us-east-1a"
        }
      + tags_all                             = {
          + "Name"       = "usopc-uat-web01"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
          + "zone"       = "us-east-1a"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "df9785a107a7ef5b9d1e49072d12ba4798517238"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {
          + cpu_credits = "standard"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = false
          + device_index          = 0
          + network_card_index    = 0
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.us-east-1.aws_lb.default-uat-l7-lb will be created
  + resource "aws_lb" "default-uat-l7-lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = true
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "default-uat-l7-lb"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-01bf06733505d2a1b",
          + "subnet-0ff7b3fc389fe6dcb",
        ]
      + tags                       = {
          + "Name"       = "default-uat-l7-lb"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + tags_all                   = {
          + "Name"       = "default-uat-l7-lb"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.us-east-1.aws_lb_listener.default-uat-l4-lb-80 will be created
  + resource "aws_lb_listener" "default-uat-l4-lb-80" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:017744138587:loadbalancer/net/default-uat-l4-lb/c2a0115e13f31eb4"
      + port              = 80
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.us-east-1.aws_lb_listener.default-uat-l7-lb-80 will be created
  + resource "aws_lb_listener" "default-uat-l7-lb-80" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Unauthorized"
              + status_code  = "401"
            }
        }
    }

  # module.us-east-1.aws_lb_listener_rule.teamusa-uat-fe will be created
  + resource "aws_lb_listener_rule" "teamusa-uat-fe" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 98
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "origin-east-1-uat-www.teamusadev.com",
                  + "origin-east-uat-www.teamusadev.com",
                  + "uat-www.teamusadev.com",
                  + "uat.teamusadev.com",
                ]
            }
        }
    }

  # module.us-east-1.aws_lb_listener_rule.usopc-uat-fe will be created
  + resource "aws_lb_listener_rule" "usopc-uat-fe" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 99
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "origin-east-1-uat-www.usopcuat.org",
                  + "origin-east-uat-www.usopcuat.org",
                  + "uat-www.usopcuat.org",
                  + "uat.usopcuat.org",
                ]
            }
        }
    }

  # module.us-east-1.aws_lb_target_group.default-uat-l4-lb-80 will be created
  + resource "aws_lb_target_group" "default-uat-l4-lb-80" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = "round_robin"
      + name                               = "default-uat-l4-lb-80"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"       = "default-uat-l4-lb-80"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + tags_all                           = {
          + "Name"       = "default-uat-l4-lb-80"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + target_type                        = "alb"
      + vpc_id                             = "vpc-0c3b58cdc704ad2f5"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.us-east-1.aws_lb_target_group.teamusa-uat-fe-8080 will be created
  + resource "aws_lb_target_group" "teamusa-uat-fe-8080" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = "round_robin"
      + name                               = "teamusa-uat-fe-8080"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"       = "teamusa-uat-fe-8080"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + tags_all                           = {
          + "Name"       = "teamusa-uat-fe-8080"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0c3b58cdc704ad2f5"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 5
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 4
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = false
          + type            = "lb_cookie"
        }
    }

  # module.us-east-1.aws_lb_target_group.usopc-uat-fe-8080 will be created
  + resource "aws_lb_target_group" "usopc-uat-fe-8080" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = "round_robin"
      + name                               = "usopc-uat-fe-8080"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"       = "usopc-uat-fe-8080"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + tags_all                           = {
          + "Name"       = "usopc-uat-fe-8080"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0c3b58cdc704ad2f5"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 5
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 4
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = false
          + type            = "lb_cookie"
        }
    }

  # module.us-east-1.aws_lb_target_group_attachment.default-uat-l4-lb-80 will be created
  + resource "aws_lb_target_group_attachment" "default-uat-l4-lb-80" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.us-east-1.aws_lb_target_group_attachment.teamusa-uat-fe-8080 will be created
  + resource "aws_lb_target_group_attachment" "teamusa-uat-fe-8080" {
      + id               = (known after apply)
      + port             = 8080
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.us-east-1.aws_lb_target_group_attachment.usopc-uat-fe-8080 will be created
  + resource "aws_lb_target_group_attachment" "usopc-uat-fe-8080" {
      + id               = (known after apply)
      + port             = 8080
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.us-east-1.aws_network_interface.usopc_uat_web01_default will be created
  + resource "aws_network_interface" "usopc_uat_web01_default" {
      + arn                       = (known after apply)
      + id                        = (known after apply)
      + interface_type            = (known after apply)
      + ipv4_prefix_count         = (known after apply)
      + ipv4_prefixes             = (known after apply)
      + ipv6_address_count        = (known after apply)
      + ipv6_address_list         = (known after apply)
      + ipv6_address_list_enabled = false
      + ipv6_addresses            = (known after apply)
      + ipv6_prefix_count         = (known after apply)
      + ipv6_prefixes             = (known after apply)
      + mac_address               = (known after apply)
      + outpost_arn               = (known after apply)
      + owner_id                  = (known after apply)
      + private_dns_name          = (known after apply)
      + private_ip                = (known after apply)
      + private_ip_list           = (known after apply)
      + private_ip_list_enabled   = false
      + private_ips               = [
          + "172.31.16.21",
        ]
      + private_ips_count         = (known after apply)
      + security_groups           = (known after apply)
      + source_dest_check         = true
      + subnet_id                 = "subnet-0ff7b3fc389fe6dcb"
      + tags                      = {
          + "Name"       = "usopc-uat-web01-default"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
          + "zone"       = "us-east-1a"
        }
      + tags_all                  = {
          + "Name"       = "usopc-uat-web01-default"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
          + "zone"       = "us-east-1a"
        }

      + attachment {
          + attachment_id = (known after apply)
          + device_index  = (known after apply)
          + instance      = (known after apply)
        }
    }

  # module.us-east-1.aws_security_group.uat_allow_inbound_tls will be created
  + resource "aws_security_group" "uat_allow_inbound_tls" {
      + arn                    = (known after apply)
      + description            = "Allow TLS inbound traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "inbound SSH from anywhere for public Github Actions"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + description      = "inbound TLS/HTTP from VPC"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + description      = "inbound TLS/HTTPS from VPC"
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8443
            },
        ]
      + name                   = "uat_allow_inbound_tls"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "uat_allow_inbound_tls"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + tags_all               = {
          + "Name"       = "uat_allow_inbound_tls"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + vpc_id                 = "vpc-0c3b58cdc704ad2f5"
    }

  # module.us-east-1.aws_security_group.uat_allow_outbound_tls will be created
  + resource "aws_security_group" "uat_allow_outbound_tls" {
      + arn                    = (known after apply)
      + description            = "Allow TLS outbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Outbound TCP from VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "uat_allow_outbound_tls"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "uat_allow_outbound_tls"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + tags_all               = {
          + "Name"       = "uat_allow_outbound_tls"
          + "env"        = "uat"
          + "managed_by" = "terraform"
          + "project"    = "usopc"
          + "region"     = "us-east-1"
        }
      + vpc_id                 = "vpc-0c3b58cdc704ad2f5"
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

*Pusher: @david-alpert-nl, Action: `pull_request`, Working Directory: ``, Workflow: `Pull Request`*